// 📊 Data type
export type WeatherDataset = {
  Эрэгэй: number;
  Эмэгтэй: number;

  label: string;
};

// 📦 Dataset
export const dataset: WeatherDataset[] = [
  {
    Эрэгэй: 59,
    Эмэгтэй: 57,

    label: "EQ-н асуулга",
  },
  {
    Эрэгэй: 50,
    Эмэгтэй: 52,

    label: "Сэтгэл гутрал",
  },
  {
    Эрэгэй: 47,
    Эмэгтэй: 53,

    label: "Бүлгийн үүрэг",
  },
  {
    Эрэгэй: 54,
    Эмэгтэй: 56,

    label: "Гэр бүлийн харилцаа",
  },
  {
    Эрэгэй: 57,
    Эмэгтэй: 69,

    label: "Зан төлөвийн хурцдал",
  },
  {
    Эрэгэй: 60,
    Эмэгтэй: 63,

    label: "Зохион байгуулах соёлын түвшин",
  },
  {
    Эрэгэй: 59,
    Эмэгтэй: 60,

    label: "Оюун ухааны чадамж",
  },
  {
    Эрэгэй: 65,
    Эмэгтэй: 60,

    label: "Стрессийн түвшин тогтоох",
  },
  {
    Эрэгэй: 51,
    Эмэгтэй: 51,

    label: "Сэтгэлийн хөдөлгөөн",
  },
  {
    Эрэгэй: 20,
    Эмэгтэй: 10,

    label: "Темперамент",
  },
  {
    Эрэгэй: 56,
    Эмэгтэй: 11,

    label: "Түгшүүрийн илрэл",
  },
  {
    Эрэгэй: 5,
    Эмэгтэй: 2,

    label: "Зорилго",
  },
   {
    Эрэгэй: 10,
    Эмэгтэй: 32,

    label: "Хандлага (өгөх/авах)",
  },
   {
    Эрэгэй: 13,
    Эмэгтэй: 32,

    label: "Удирдах хэв маяг",
  },
   {
    Эрэгэй: 20,
    Эмэгтэй: 30,

    label: "Ажлын байрны сэтгэл ханамжийн судалгаа",
  },
];

// 🔢 Formatter
export function valueFormatter(value: number): string {
  return `${value}mm`;
}
